bolknote/MK61S_MINI/code/m61_text.cpp
  if(context.phase == core_61::Mk61CommandHookPhase::AFTER_EXECUTE) {
    if(bind_pending && context.sequence == pending_bind_sequence) {
      bind_ready = true;
    }
    return;
  }

  if(context.phase != core_61::Mk61CommandHookPhase::BEFORE_EXECUTE ||
     runner_state != RunnerState::WATCH_EVENTS ||
     bind_handler_active || bind_pending ||
     !bind_is_active(context.opcode)) {
    return;
  }

  const i16 bind_index = find_bind_index(context.opcode);
  if(bind_index < 0 || binds[bind_index].target >= label_count) return;

  pending_bind_target = binds[bind_index].target;
  pending_bind_sequence = context.sequence;
  bind_pending = true;
  bind_ready = false;
  // bind является горячей клавишей, а не наблюдателем: исходная операция
  // калькулятора поглощается, но завершает штатный клавиатурный цикл через NOP.
  context.replacement_opcode = (u8) MK61_NOP;
}

static bool enter_pending_bind(void) {
  if(!bind_pending || !bind_ready ||
     pending_bind_target >= label_count) {
    return false;
  }
  const u8 target = pending_bind_target;
  if(!push_current_frame(ReturnKind::BIND)) {
    line_error_message = "bind return stack is full";
    return false;
  }

  bind_pending = false;
  bind_ready = false;
  pending_bind_target = INVALID_BIND_TARGET;
  pending_bind_sequence = 0;
  bind_handler_active = true;

  const LabelEntry& entry = labels[target];
  script_pos = entry.target_pos;
  script_line = entry.target_line;
  invalidate_read_cache();
  runner_state = RunnerState::EXECUTING;
  return true;
}

static bool program_boundary_hook(
    const core_61::Mk61ProgramBoundaryContext& context, void* user_data) {
  if((runner_state != RunnerState::WAIT_RUN_STOP &&
      runner_state != RunnerState::WATCH_EVENTS) ||
     !core_61::is_RUN()) {
    return false;
  }

  if(bypass_trap_once) {
    const bool bypass = context.address == bypass_trap_address;
    bypass_trap_once = false;
    if(bypass) return false;
  }

#if MK61_STM32_SRAM_BIT_BAND_AVAILABLE
  const volatile u32* active_bits =
      reinterpret_cast<volatile u32*>(user_data);
  if(context.address >= TRAP_ADDRESS_COUNT ||
     active_bits[context.address] == 0) return false;
#else
  (void) user_data;
  if(!trap_is_active(context.address)) return false;
#endif
  const u8 target = trap_targets[context.address];
  if(target == INVALID_TRAP_TARGET || target >= label_count) return false;
  trap_pending = true;
  pending_trap_address = context.address;
  pending_trap_target = target;
  return true;
}

static bool enter_pending_trap(void) {
  if(!trap_pending || pending_trap_target >= label_count) return false;
  const u8 address = pending_trap_address;
  const u8 target = pending_trap_target;

  if(!push_current_frame(ReturnKind::TRAP)) {
    line_error_message = "trap return stack is full";
    return false;
  }
  core_61::ContextBuffer* saved = core_61::acquire_context_buffer(
      core_61::ContextBufferOwner::M61_TRAP);
  if(saved == nullptr || !core_61::save_context(*saved)) {
    release_trap_context();
    return_stack_depth--;
    line_error_message = "cannot save calculator trap context";
    return false;
  }

  trap_pending = false;
  pending_trap_address = 0;
  pending_trap_target = INVALID_TRAP_TARGET;
  suspended_trap_address = address;

  const LabelEntry& entry = labels[target];
  script_pos = entry.target_pos;
  script_line = entry.target_line;
  invalidate_read_cache();
  runner_state = RunnerState::EXECUTING;
  return true;
}

enum class ReferencedOpenResult : u8 {
  OPENED = 0,
  STOPPED = 1,
  FAILED = 2
};

#ifndef M61_TEXT_HOST_TEST
static ReferencedOpenResult open_referenced_entry(
    const program_store::Entry& entry) {
  if(entry.type == program_store::ProgramType::TINYBASIC) {
    const TinyBasicRunStatus status = RunTinyBasicProgramStatus(
        entry.id, TinyBasicRunMode::M61_SCENARIO);
    if(status == TinyBasicRunStatus::COMPLETED) {
      return ReferencedOpenResult::OPENED;
    }
    if(status == TinyBasicRunStatus::STOPPED) {
      return ReferencedOpenResult::STOPPED;
    }
    return ReferencedOpenResult::FAILED;
  }
  return OpenStoredEntry(entry) ? ReferencedOpenResult::OPENED
                                : ReferencedOpenResult::FAILED;
}
#endif

static ReferencedOpenResult open_referenced_file(const char* path) {
#ifndef M61_TEXT_HOST_TEST
  u16 cwd = program_store::ROOT_ID;
  if(script_id != program_store::INVALID_ID) {
    program_store::Entry current;
    if(program_store::entry_by_id(script_id, current)) cwd = current.parent_id;
  }

  program_store::Entry entry;
  if(storage_path::resolve_file(cwd, path, entry) ==
     storage_path::Status::OK) {
    return open_referenced_entry(entry);
  }
  // Совместимость со старыми сценариями без каталогов: простое имя, которого
  // нет рядом с вызывающим сценарием, всё ещё может обозначать файл в корне.
  // Для явно относительных путей переход к несвязанному объекту запрещён.
  if(cwd != program_store::ROOT_ID && strchr(path, '/') == NULL &&
     strchr(path, '\\') == NULL &&
     storage_path::resolve_file(program_store::ROOT_ID, path, entry) ==
         storage_path::Status::OK) {
    return open_referenced_entry(entry);
  }
  return ReferencedOpenResult::FAILED;
#else
  return (ReferencedOpenResult) m61_text_host_open_file(path);
#endif
}

#if M61_TEXT_FONT_COMMAND
static bool loadfont_arguments(const char* line, const char*& args) {
  static const char keyword[] = "loadfont";
  const char* p = skip_spaces(line);
  const usize length = sizeof(keyword) - 1U;
  if(strncmp(p, keyword, length) != 0 ||
     (!is_space(p[length]) && !is_line_end(p[length]))) return false;
  args = skip_spaces(p + length);
  return true;
}

static u16 current_script_directory(void) {
  program_store::Entry entry;
  return script_id != program_store::INVALID_ID &&
      program_store::entry_by_id(script_id, entry)
      ? entry.parent_id : program_store::ROOT_ID;
}

static bool execute_loadfont(const char* args) {
  if(token_ends(args)) {
    if(!text_font_session_active) return true;
    if(program_store_text_font_restore() == 1) return true;
    line_error_message = "cannot restore default font";
    return false;
  }

