bolknote/MK61S_MINI/code/m61_text.cpp
  if(!text_font_session_active) {
    const i32 begin = program_store_text_font_begin();
    if(begin != 1) {
      line_error_message = begin == -2
          ? "loadfont requires UC1609"
          : "font service is unavailable";
      return false;
    }
    text_font_session_active = true;
  }

  const u16 directory = current_script_directory();
  bool selected = false;
  bool stopped = false;
  i32 result = 0;
  const char* cursor = args;
  while(!terminal_core::at_end(cursor)) {
    char name[program_store::NAME_SIZE + 16U];
    if(!terminal_core::parse_token(cursor, name, sizeof(name))) {
      line_error_message =
          "invalid loadfont syntax (use names separated by spaces)";
      return false;
    }
    if(selected || stopped) continue;
    const i32 attempt = program_store_text_font_load_from(name, directory);
    if(attempt == 1) {
      selected = true;
    } else if(attempt == -1) {
      result = -1;
    } else if(attempt == -2 || attempt == -3) {
      result = attempt;
      stopped = true;
    } else if(attempt != 0) {
      result = -3;
      stopped = true;
    }
  }
  if(selected) return true;
  if(result == -1) line_error_message = "font file is invalid";
  else if(result == -2) line_error_message = "loadfont requires UC1609";
  else if(result == -3) line_error_message = "font service is unavailable";
  else line_error_message = "font not found";
  return false;
}
#endif

static void clear_frame_handlers(ScriptFrame& frame) {
  memset(frame.active_traps, 0, sizeof(frame.active_traps));
  memset(frame.active_bind_opcodes, INVALID_BIND_OPCODE,
         sizeof(frame.active_bind_opcodes));
}

static void clear_active_handlers(void) {
  clear_bind_hooks();
  clear_active_traps();
  clear_active_binds();
  for(u8 i = 0; i < return_stack_depth; i++) {
    clear_frame_handlers(return_stack[i].script);
  }

  trap_pending = false;
  pending_trap_address = 0;
  pending_trap_target = INVALID_TRAP_TARGET;
  bypass_trap_once = false;
  bypass_trap_address = 0;
  bind_pending = false;
  bind_ready = false;
  pending_bind_target = INVALID_BIND_TARGET;
  pending_bind_sequence = 0;
}

static bool frame_has_active_handlers(const ScriptFrame& frame) {
  for(u8 i = 0; i < TRAP_BITMAP_SIZE; i++) {
    if(frame.active_traps[i] != 0) return true;
  }
  for(u8 i = 0; i < MAX_BINDS; i++) {
    if(frame.active_bind_opcodes[i] != INVALID_BIND_OPCODE) return true;
  }
  return false;
}

bool clear_bindings_and_traps(void) {
  bool had_handlers =
      any_trap_is_active() || any_bind_is_active() ||
      trap_pending || trap_context_valid() ||
      bind_pending || bind_handler_active ||
      runner_state == RunnerState::WATCH_EVENTS;
  for(u8 i = 0; i < return_stack_depth && !had_handlers; i++) {
    had_handlers = frame_has_active_handlers(return_stack[i].script);
  }
  if(!had_handlers) return false;

  clear_active_handlers();
  // После корневого ret выполнять больше нечего: освобождаем boundary hook,
  // дисплей и runner. Исполняющийся сценарий или текущий обработчик завершает
  // свой обычный путь; очищенные кадры не восстановят старые bind/trap.
  if(runner_state == RunnerState::WATCH_EVENTS) stop_runner();
  return true;
}

// Вся грамматика команд разбирается терминалом (единый диспетчер интерактивного
// и скриптового режимов). Сценарию терминал возвращает только действия,
// влияющие на поток выполнения: run, open, load, переходы по меткам и reinit.
static bool execute_script_line(const char* raw_line) {
  line_error_message = NULL;
  const char* line = skip_spaces(raw_line);
  if(is_line_end(*line)) return true;
  if(*line == ':') return true; // Метка — точка перехода, сама по себе ничего не делает

#if M61_TEXT_FONT_COMMAND
  const char* font_args = NULL;
  if(loadfont_arguments(line, font_args)) return execute_loadfont(font_args);
#endif

  ParsedTrap parsed_trap = {};
  const TrapParse trap_result = parse_trap(line, parsed_trap);
  if(trap_result == TrapParse::VALID) {
    set_trap_active(parsed_trap.address, true);
    return true;
  }
  if(trap_result == TrapParse::INVALID) {
    line_error_message = "invalid trap (use: trap <0..111> run :label)";
    return false;
  }

  ParsedBind parsed_bind = {};
  const BindParse bind_result = parse_bind(line, parsed_bind);
  if(bind_result == BindParse::VALID) {
    if(activate_bind(parsed_bind.opcode)) return true;
    line_error_message = "cannot activate bind command hooks";
    return false;
  }
  if(bind_result == BindParse::INVALID) {
    line_error_message = "invalid bind (use: bind <00..EF> run :label)";
    return false;
  }

  const terminal_protocol::Result result =
      terminal_script::execute(line, trap_context_valid());
  switch(result.kind) {
    case terminal_protocol::ResultKind::OK:
      return true;
    case terminal_protocol::ResultKind::RUN_PROGRAM:
      if(start_current_program()) return true;
      line_error_message = trap_context_valid()
          ? "cannot run calculator from a trap handler"
          : "active trap address is outside current program memory";
      return false;
    case terminal_protocol::ResultKind::OPEN_FILE:
      switch(open_referenced_file(result.args)) {
        case ReferencedOpenResult::OPENED:
          return true;
        case ReferencedOpenResult::STOPPED:
          // ESC inside a nested interpreter belongs to the M61 scenario as a
          // whole. stop_runner() closes the scoped font session first; only
          // then redraw the ordinary calculator face. This path deliberately
          // has no error overlay and no second acknowledgement wait.
          cancel();
          lcd_std_display_redraw();
          return true;
        case ReferencedOpenResult::FAILED:
          break;
      }
      line_error_message = "cannot open referenced file";
      return false;
    case terminal_protocol::ResultKind::LOAD_SLOT:
      if(open_slot(result.args)) return true;
      line_error_message = "cannot load nested slot";
      return false;
    case terminal_protocol::ResultKind::GOTO_LABEL:
      if(goto_label(result.args)) return true;
      line_error_message = "label not found or invalid";
      return false;
    case terminal_protocol::ResultKind::MEASURE_NEXT_RUN:
      if(trap_context_valid()) {
        line_error_message = "measure is not allowed in a trap handler";
        return false;
      }
      hidden_return_to_program_start();
      run_measurement::arm_next();
      return true;
    case terminal_protocol::ResultKind::WAIT:
      if(result.key <= 0 || result.key > 60000) {
        line_error_message = "invalid wait duration";
        return false;
      }
      wait_until_ms = runner_millis() + (u32) result.key;
      runner_state = RunnerState::WAIT_TIME;
      return true;
    case terminal_protocol::ResultKind::RETURN_SCRIPT:
      return return_from_script();
    case terminal_protocol::ResultKind::REINIT_CALCULATOR:
      if(trap_context_valid()) {
        line_error_message = "reinit is not allowed in a trap handler";
        return false;
      }
      clear_active_handlers();
      display_claimed = false;
      run_measurement::cancel();
      reinit_mk61_calculator_state();
      return true;
    case terminal_protocol::ResultKind::ERROR:
    case terminal_protocol::ResultKind::KEY:
      line_error_message = "terminal command failed";
      return false;
  }
  return false;
}

