bolknote/MK61S_MINI/code/m61_text.cpp
void service(void) {
  if(runner_state == RunnerState::WAIT_TIME) {
    if(!time_reached(runner_millis(), wait_until_ms)) return;
    wait_until_ms = 0;
    runner_state = RunnerState::EXECUTING;
  }

  if(trap_pending) {
    const u16 trap_line = script_line;
    if(!enter_pending_trap()) {
      fail_script(line_error_message == NULL ? "cannot enter trap handler" : line_error_message,
                  trap_line);
      return;
    }
  }

  if(bind_pending && bind_ready) {
    const u16 bind_line = script_line;
    if(!enter_pending_bind()) {
      fail_script(line_error_message == NULL
                      ? "cannot enter bind handler"
                      : line_error_message,
                  bind_line);
      return;
    }
  }

  if(runner_state == RunnerState::WAIT_RUN_STOP) {
    if(!core_61::is_CALC()) return;
    // Программа МК остановилась: управление возвращается к следующей строке сценария.
    core_61::clear_displayed();
    runner_state = RunnerState::EXECUTING;
  }

  // Бюджет строк на вызов: бесконечный цикл по меткам (run :метка) не должен
  // блокировать основной loop() - продолжение в следующей итерации.
  usize budget = SCRIPT_LINE_BUDGET;
  while(runner_state == RunnerState::EXECUTING) {
    if(budget-- == 0) return;
    if(script_pos >= script_len) {
      finish_script();
      return;
    }

    const u16 line_number = script_line;
    char line[MAX_LINE_SIZE + 1];
    if(!read_next_line(line, sizeof(line))) {
      fail_script("cannot read script or line is too long", line_number);
      return;
    }
    if(!execute_script_line(line)) {
      fail_script(line_error_message == NULL ? "command failed" : line_error_message, line_number);
      return;
    }
  }
}

static bool load_frame(const ScriptFrame& frame) {
  ScriptFrame next = frame;
  const bool restart_same_root =
      runner_state == RunnerState::WATCH_EVENTS &&
      return_stack_depth == 0 &&
      script_source == ScriptSource::STORE &&
      frame.source == ScriptSource::STORE &&
      script_id == frame.id;
  if(restart_same_root) {
    save_active_traps(next.active_traps);
    save_active_binds(next.active_bind_opcodes);
  }
  run_measurement::cancel();
  if(active()) stop_runner();
  clear_error();

  const char* error_message = NULL;
  u16 error_line = 0;
  if(!activate_frame(next, error_message, error_line)) {
    fail_script(error_message, error_line);
    return false;
  }
  return_stack_depth = 0;
  script_stack_depth = 0;
  display_claimed = false;
  wait_until_ms = 0;
  clear_trap_runtime(false);
  clear_bind_runtime();
  if(!core_61::set_mk61_program_boundary_hook(
      program_boundary_hook, active_trap_boundary_hook_data())) {
    fail_script("calculator boundary hook is unavailable", 0);
    return false;
  }
  boundary_hook_installed = true;
  terminal_script::reset();
  MK61Emu_ClearCodePage();
  runner_state = RunnerState::EXECUTING;
  service();
  return !has_error;
}

bool load_program(const char* name) {
  if(name == NULL || name[0] == 0) return false;
  ScriptFrame frame;
  if(!make_store_frame(name, frame)) {
    copy_script_name(script_name, name);
    fail_script("script not found", 0);
    return false;
  }
  return load_frame(frame);
}

bool load_program(u16 id) {
  ScriptFrame frame;
  if(!make_store_frame(id, frame)) return false;
  return load_frame(frame);
}

// Единственная точка открытия МК61-скрипта по имени (через OpenStoredEntry):
// изнутри выполняющегося сценария — вложенный вызов с возвратом на следующую
// строку, извне (терминал, проводник, меню) — свежая загрузка.
bool open_program(const char* name) {
  if(runner_state == RunnerState::EXECUTING) return open_store_script(name);
  return load_program(name);
}

bool open_program(u16 id) {
  if(runner_state == RunnerState::EXECUTING) return open_store_script(id);
  return load_program(id);
}

static bool append_char(u8* out, u16 capacity, u16& pos, char c) {
  if(pos >= capacity) return false;
  out[pos++] = (u8) c;
  return true;
}

static bool append_text(u8* out, u16 capacity, u16& pos, const char* text) {
  while(*text != 0) {
    if(!append_char(out, capacity, pos, *text++)) return false;
  }
  return true;
}

static char hex_digit(u8 value) {
  value &= 0x0F;
  return (value < 10) ? (char) ('0' + value) : (char) ('A' + value - 10);
}

static bool append_decimal4(u8* out, u16 capacity, u16& pos, u16 value) {
  if(value > 9999) return false;
  if(!append_char(out, capacity, pos, (char) ('0' + (value / 1000) % 10))) return false;
  if(!append_char(out, capacity, pos, (char) ('0' + (value / 100) % 10))) return false;
  if(!append_char(out, capacity, pos, (char) ('0' + (value / 10) % 10))) return false;
  return append_char(out, capacity, pos, (char) ('0' + value % 10));
}

static bool append_hex_byte(u8* out, u16 capacity, u16& pos, u8 value) {
  if(!append_char(out, capacity, pos, hex_digit((u8) (value >> 4)))) return false;
  return append_char(out, capacity, pos, hex_digit(value));
}

bool format_current_program(u8* out, u16 capacity, u16* out_len) {
  if(out_len != NULL) *out_len = 0;
  if(out == NULL && capacity != 0) return false;

  u8 code_page[core_61::CODE_PAGE_BUFFER_SIZE] = {};
  core_61::get_code_page(&code_page[0]);

  const u16 program_steps = (u16) core_61::program_steps();
  u16 pos = 0;
  for(u16 offset = 0; offset < program_steps; offset = (u16) (offset + HIN_BYTES_PER_LINE)) {
    const u16 remaining = (u16) (program_steps - offset);
    const u8 line_len = (remaining > HIN_BYTES_PER_LINE) ? HIN_BYTES_PER_LINE : (u8) remaining;
    if(!append_text(out, capacity, pos, "hin ")) return false;
    if(!append_decimal4(out, capacity, pos, offset)) return false;
    if(!append_char(out, capacity, pos, ' ')) return false;
    for(u8 i = 0; i < line_len; i++) {
      if(!append_hex_byte(out, capacity, pos, code_page[offset + i])) return false;
    }
    if(!append_char(out, capacity, pos, '\n')) return false;
  }

  if(out_len != NULL) *out_len = pos;
  return true;
}

} // пространство имён m61_text
